Repository: ialfmappadm/IALFM-Prayer-Times-App
Catalog: lib/l10n/app_*.arb
Languages: ar

# tab_more
source: More
ar: المزيد

# tab_directory
source: Directory
ar: الدليل

# more_accessibility
source: Accessibility
ar: إمكانية الوصول

# more_notifications
source: Notifications
ar: الإشعارات

# more_app_notifications
source: App notifications
ar: إشعارات التطبيق

# more_app_notifications_title
source: App notifications
ar: إشعارات التطبيق

# more_notifications_open_settings
source: Open Settings
ar: فتح الإعدادات

# more_notifications_disable_in_settings
source: Disable in Settings
ar: التعطيل من الإعدادات

source: Allow exact alarms
ar: السماح بالتنبيهات الدقيقة

# openAlarmsAndReminders
source: Open Alarms & reminders
ar: فتح إعداد «المنبّهات والتذكيرات»

source: Exact alarms enabled
ar: تم تمكين التنبيهات الدقيقة

# more_time
source: Time
ar: الوقت

# more_language
source: Language
ar: اللغة

# more_data_storage
source: Data & Storage
ar: البيانات والتخزين

# more_dark_mode
source: Dark Mode
ar: الوضع الداكن

# more_haptics
source: Haptic Feedback
ar: الاستجابة اللمسية

# more_text_size
source: Text Size
ar: حجم الخط

# more_time_format
source: Time Format
ar: تنسيق الوقت

# more_language_label
source: App Language
ar: لغة التطبيق

# more_enable_notifications
source: Enable Notifications
ar: تفعيل الإشعارات

# more_refresh_data
source: Refresh Data Now
ar: تحديث البيانات الآن

# more_last_sync
source: Last Sync
ar: آخر مزامنة

# more_date_time
source: Date & Time
ar: التاريخ والوقت

# more_hijri_offset_label
source: Hijri Date Offset
ar: تعديل التاريخ الهجري

# more_hijri_reset_label
source: Reset Hijri Date
ar: إعادة ضبط التاريخ الهجري

# more_hijri_offset_minus1
source: -1 day
ar: يوم −1

# more_hijri_offset_plus1
source: +1 day
ar: يوم +1

# more_prayer_alerts
source: Salah Alerts
ar: تنبيهات الصلاة

# more_adhan
source: Adhan
ar: الأذان

# more_iqamah
source: Iqamah
ar: الإقامة

# more_adhan_alert_at_time
source: Adhan Alert (at Adhan time)
ar: تنبيه الأذان (وقت الأذان)

# more_iqamah_alert_5min
source: Iqamah Alert (5 minutes before)
ar: تنبيه الإقامة (قبل 5 دقائق)

# more_jumuah_reminder
source: Jumu’ah
ar: الجمعة

# more_jumuah_reminder_label
source: Jumu’ah reminder 1 hour before the Khutbah
ar: تذكير الجمعة قبل الخطبة بساعة

# more_jumuah_off
source: Off (1 hour before Jumu’ah)
ar: غير مفعل (قبل ساعة من الجمعة)

# more_about
source: About
ar: حول التطبيق

# more_version
source: Version
ar: الإصدار

# more_about_app
source: About the App
ar: عن التطبيق

# more_about_app_body
source: IALFM Prayer Times App for daily Salah.
ar: تطبيق مواقيت الصلاة لـ IALFM للصلاة اليومية.

# more_privacy_policy
source: Privacy Policy
ar: سياسة الخصوصية

# more_disclaimer
source: Disclaimer
ar: إخلاء المسؤولية

# more_licensing
source: Licensing
ar: الترخيص

# more_contact
source: Contact
ar: تواصل معنا

# common_open
source: Open
ar: فتح

# common_enabled
source: Enabled
ar: مفعل

# common_disabled
source: Disabled
ar: غير مفعل

# common_enable
source: Enable
ar: تفعيل

# common_open_settings
source: Open Settings
ar: فتح الإعدادات

# common_check
source: Check
ar: تحقّق

# common_on
source: On
ar: تشغيل

# common_off
source: Off
ar: إيقاف

# btn_close
source: Close
ar: إغلاق

# btn_cancel
source: Cancel
ar: إلغاء

# btn_save
source: Save
ar: حفظ

# dir_section_contact
source: Contact
ar: التواصل

# dir_section_management
source: Management
ar: الإدارة

# dir_section_programs
source: Programs
ar: البرامج

# dir_section_resources
source: Resources
ar: الموارد

# dir_contact_us
source: Contact Us
ar: تواصل معنا

# dir_contact_us_feedback
source: Contact Us & Feedback
ar: الاتصال والاقتراحات

# dir_imam
source: Our Imam
ar: إمامنا

# dir_board
source: Board of Directors
ar: مجلس الإدارة

# dir_committees
source: Committees
ar: اللجان

# dir_sunday_school
source: Sunday School
ar: مدرسة الأحد

# dir_pillars
source: Pillars Academy
ar: أكاديمية بيـلارز

# dir_quran_school
source: Quran School
ar: مدرسة القرآن

# dir_membership
source: Membership
ar: العضوية

# dir_signup_individual
source: Signup – Individual
ar: تسجيل – فرد

# dir_signup_family
source: Signup – Family
ar: تسجيل – عائلة

# dir_renew
source: Renew (Member Login)
ar: تجديد (تسجيل دخول الأعضاء)

# dir_newsletter
source: Newsletter
ar: النشرة البريدية

# dir_open_latest_newsletter
source: Open Latest Newsletter
ar: فتح أحدث نشرة

# dir_view_all_newsletters
source: View All Past Newsletters
ar: استعراض جميع النشرات السابقة

# dir_link_tree
source: Link Tree - IALFM
ar: روابط IALFM

# dir_link_tree_youth
source: Link Tree - IALFM Youth
ar: روابط شباب IALFM

# dir_calendar
source: Annual Calendar
ar: جدول المناسبات

# dir_erf
source: Emergency Relief Fund
ar: صندوق الإغاثة الطارئة

# dir_docs
source: IALFM Documents
ar: مستندات IALFM

# dir_volunteer
source: Become a Volunteer
ar: كن متطوعًا

# notifications_title
source: Announcements
ar: أخبار هامة

# social_follow_us
source: Follow Us…
ar: :تابعنا على

# ann_default_title
source: Announcement
ar: إعلان

# ann_empty_title
source: No active announcement
ar: لا توجد إعلانات حالياً

# ann_empty_body
source: Please check back later.
ar: يرجى التحقق لاحقًا.

# version_page_title
source: App Version
ar: إصدار التطبيق

# version_installed_build
source: Installed Build
ar: البناء المثبّت

# version_label
source: Version
ar: الإصدار

# build_label
source: Build
ar: البناء

# version_disclaimer
source: Values reflect the installed build (iOS: CFBundleShortVersionString/CFBundleVersion; Android: versionName/versionCode) derived from pubspec at build time.
ar: تُظهر هذه القيم الإصدار والبناء المثبَّتين على هذا الجهاز (iOS: CFBundleShortVersionString/CFBundleVersion؛ Android: versionName/versionCode) والمشتقة من pubspec وقت البناء.

# more_terms_of_use
source: Terms of Use
ar: شروط الاستخدام

# more_app_version
source: App Version
ar: إصدار التطبيق

# about_overview
source: Overview
ar: نظرة عامة

# about_overview_body
source: IALFM Prayer Times is the official IALFM mobile app for Dallas/Fort Worth (Central Time). It focuses on reliable daily Salah times, clear announcements, and simple, respectful notifications—without accounts, ads, or GPS tracking.
ar: تطبيق مواعيد الصلاة لـ IALFM هو التطبيق الرسمي لمنطقة دالاس/فورت وورث (التوقيت المركزي). يركّز على مواعيد صلاة موثوقة يوميًا، وإعلانات واضحة، وتنبيهات بسيطة ومحترمة — دون حسابات أو إعلانات أو تتبع GPS.

# about_key_features
source: Key Features
ar: أهم الميزات

# about_feature_1
source: Displays daily Salah times with Central Time support and automatic DST awareness.
ar: عرض مواعيد الصلاة اليومية مع دعم التوقيت المركزي وتبديل التوقيت الصيفي تلقائيًا.

# about_feature_2
source: Hijri Calendar offset control (+1 / 0 / −1) to match local moon sighting.
ar: ضبط تقويم الهجري (+1 / 0 / −1) ليتوافق مع رؤية الهلال المحلية.

# about_feature_3
source: Firebase FCM Announcements for timely, community updates (opt‑in).
ar: إعلانات عبر Firebase FCM لتحديثات المجتمع في الوقت المناسب (اختياري).

# about_feature_4
source: Arabic language support; switch between English/Arabic from the app.
ar: دعم اللغة العربية؛ يمكنك التبديل بين العربية والإنجليزية من داخل التطبيق.

# about_feature_5
source: Displays Weekly Newsletter / Announcements when available.
ar: عرض النشرة الأسبوعية / الإعلانات عند توفرها.

# about_feature_6
source: Accessibility: Light & Dark theme and adjustable text size.
ar: إمكانية الوصول: السمة الفاتحة/الداكنة، الاهتزاز اللمسي (إن كان مدعومًا)، وتكبير حجم النص.

# about_feature_7
source: Local alerts (Adhan/Iqamah reminders) scheduled on device, with simple toggles.
ar: تنبيهات محلية (الأذان/الإقامة) تُجدول على الجهاز مع مفاتيح تشغيل بسيطة.

# about_feature_8
source: Offline fallback schedule bundled; app can fetch new schedules when available.
ar: ملف جدول محلي للعمل دون اتصال؛ ويمكن للتطبيق جلب جداول محدثة عند توفرها.

# about_feature_9
source: Privacy‑first: no user accounts, no precise GPS, and no targeted advertising.
ar: خصوصية أولاً: لا حسابات للمستخدمين، ولا GPS دقيق، ولا إعلانات مستهدفة.

# about_quick_links
source: Quick Links
ar: روابط سريعة

# about_visit_website
source: Visit IALFM Website
ar: زيارة موقع IALFM

# about_view_full_privacy_policy
source: View Full Privacy Policy (Website)
ar: عرض سياسة الخصوصية كاملة (الموقع)

# about_app_version_button
source: App Version & Build
ar: إصدار التطبيق والبناء

# about_disclaimer
source: In‑App Disclaimer
ar: إخلاء مسؤولية داخل التطبيق

# about_disclaimer_body
source: Important announcements from IALFM may be delivered as notifications so you don’t miss urgent updates. OS‑level notification settings are controlled by you; if you disable notifications at the system level, you can still read new items in the Announcements tab. Licensing: The app is free to use for the IALFM community. Redistribution or commercial distribution is not permitted without IALFM’s written permission.
ar: قد تُرسَل الإعلانات المهمة من IALFM كإشعارات لكي لا تفوّت التحديثات العاجلة. إعدادات الإشعارات على مستوى النظام يتحكم بها المستخدم؛ إذا عطّلت الإشعارات من النظام فما زال بإمكانك قراءة الجديد ضمن تبويب الإعلانات. الترخيص: التطبيق مجاني لمجتمع IALFM. لا يُسمح بإعادة التوزيع أو التوزيع التجاري دون إذن خطي من IALFM.

# privacy_title
source: Privacy Policy
ar: سياسة الخصوصية

# privacy_summary
source: Summary
ar: ملخص

# privacy_b1
source: We do not collect personal information, create user accounts, or track you across apps.
ar: لا نجمع معلومات شخصية، ولا ننشئ حسابات، ولا نتتبعك عبر التطبيقات.

# privacy_b2
source: The app reads only your device timezone to show correct Salah times. We do NOT collect precise GPS location.
ar: يقرأ التطبيق منطقة توقيت جهازك فقط لعرض مواعيد الصلاة بشكل صحيح. لا نجمع موقع GPS الدقيق.

# privacy_b3
source: Prayer reminders and alerts are optional; notification settings are stored on your device. A Firebase Cloud Messaging token may be used to deliver notifications and is not linked to your identity.
ar: التنبيهات اختيارية؛ تُحفَظ إعدادات الإشعارات على جهازك. قد يُستخدم رمز Firebase FCM لتسليم الإشعارات ولا يُربط بهويتك.

# privacy_b4
source: The app may fetch non‑personal content (e.g., announcements, schedule updates) from Firebase Remote Config/Storage; an offline schedule is also bundled.
ar: قد يجلب التطبيق محتوى غير شخصي (مثل الإعلانات والجدول) من Firebase Remote Config/Storage؛ كما يتضمن جدولًا محليًا للعمل دون اتصال.

# privacy_b5
source: We store non‑identifying preferences locally on your device (e.g., theme, text size, Hijri offset, alert toggles).
ar: نخزّن تفضيلات غير معرِّفة محليًا على جهازك (مثل السمة، حجم النص، إزاحة التقويم الهجري، مفاتيح التنبيه).

# privacy_b6
source: Weather is shown using a fixed Dallas‑area coordinate (not your location) via the Open‑Meteo API.
ar: يُعرض الطقس باستخدام إحداثية ثابتة لمنطقة دالاس (وليس موقعك) عبر Open‑Meteo.

# privacy_b7
source: A Mohid donation link opens in your web browser and is processed outside the app; donations do not unlock features, and payment data is not handled by the app.
ar: رابط التبرع عبر Mohid يُفتح في المتصفح ويُعالَج خارج التطبيق؛ لا تفتح التبرعات ميزات، ولا يتعامل التطبيق مع بيانات الدفع.

# privacy_b8
source: We do not sell or share personal data with third parties and do not use targeted advertising.
ar: لا نبيع أو نشارك البيانات الشخصية مع أطراف ثالثة ولا نستخدم إعلانات مستهدفة.

# privacy_view_full
source: View the Full Policy
ar: عرض السياسة الكاملة

# privacy_view_full_hint
source: For the complete policy text, open the published page on our website.
ar: لفحص النص الكامل للسياسة، افتح الصفحة المنشورة على موقعنا.

# open_full_policy_button
source: Open Full Policy (Website)
ar: فتح السياسة الكاملة (الموقع)

# terms_agreement
source: Agreement
ar: الاتفاقية

# terms_agreement_body
source: By installing or using IALFM Prayer Times, you agree to these Terms of Use. If you do not agree, please uninstall the app.
ar: بتثبيت أو استخدام تطبيق مواعيد الصلاة لـ IALFM فأنت توافق على شروط الاستخدام. إذا لم توافق، يُرجى إزالة التطبيق.

# terms_acceptable_use
source: Acceptable Use
ar: الاستخدام المقبول

# terms_acceptable_b1
source: Use the app only for lawful, personal, and non‑commercial purposes.
ar: استخدم التطبيق للأغراض القانونية والشخصية وغير التجارية فقط.

# terms_acceptable_b2
source: Do not attempt to reverse‑engineer, disrupt, or misuse the app or its services.
ar: يُحظر محاولة الهندسة العكسية أو التعطيل أو إساءة استخدام التطبيق أو خدماته.

# terms_content_links
source: Content & Third‑Party Links
ar: المحتوى والروابط الخارجية

# terms_links_b1
source: Announcements and schedule data are provided for convenience and may change.
ar: تُقدَّم الإعلانات والجدول للتسهيل وقد تتغير.

# terms_links_b2
source: External links (e.g., Mohid donations, Instagram, Facebook) open outside the app and are governed by their own terms and policies.
ar: الروابط الخارجية (مثل Mohid، إنستغرام، فيسبوك) تُفتح خارج التطبيق وتخضع لشروط وسياسات مواقعها.

# terms_donations
source: Donations
ar: التبرعات

# terms_donations_b1
source: Any donations are processed on third‑party sites (e.g., Mohid); the app does not handle payment information. Donations do not unlock features.
ar: تعالج التبرعات على مواقع خارجية (مثل Mohid)؛ لا يتعامل التطبيق مع معلومات الدفع. لا تفتح التبرعات ميزات.

# terms_no_warranty
source: No Warranty
ar: عدم تقديم ضمان

# terms_no_warranty_b1
source: The app is provided “as is” without warranties of any kind.
ar: يُقدَّم التطبيق "كما هو" دون أي ضمانات.

# terms_no_warranty_b2
source: We do not guarantee uninterrupted or error‑free operation, or accuracy of data.
ar: لا نضمن التشغيل المتواصل أو الخالي من الأخطاء أو دقة البيانات.

# terms_liability
source: Limitation of Liability
ar: تحديد المسؤولية

# terms_liability_b1
source: To the maximum extent permitted by law, IALFM and volunteers are not liable for any damages arising from use of the app.
ar: ضمن الحد الأقصى المسموح به قانونًا، لا تتحمل IALFM والمتطوعون أي مسؤولية عن الأضرار الناتجة عن استخدام التطبيق.

# terms_ip
source: Intellectual Property
ar: الملكية الفكرية

# terms_ip_b1
source: All trademarks, logos, and content remain the property of their respective owners.
ar: جميع العلامات والشعارات والمحتوى تبقى ملكًا لأصحابها.

# terms_ip_b2
source: Redistribution or commercial distribution of the app or its content is not permitted without IALFM’s written permission.
ar: لا يُسمح بإعادة التوزيع أو التوزيع التجاري للمحتوى دون إذن خطي من IALFM.

# terms_privacy_header
source: Privacy
ar: الخصوصية

# terms_privacy_body
source: Your use of the app is also subject to our Privacy Policy.
ar: يخضع استخدامك للتطبيق كذلك لسياسة الخصوصية.

source: View Privacy Policy (Website)
ar: عرض سياسة الخصوصية (الموقع)

# about_offline_hint
source: Prayer times continue to work even without internet access.
ar: تستمر أوقات الصلاة بالعمل حتى بدون اتصال بالإنترنت.

# about_timing_note_title
source: Delivery timing on Android
ar: توقيت التسليم على أندرويد

# about_timing_note_body
source: To save battery, Android’s power optimizations (Doze / App Standby) may delay non‑exact notifications on some devices. To improve punctual delivery for prayer alerts, you can enable “Allow exact alarms” in Settings.
ar: لتوفير الطاقة، قد تؤخر تحسينات النظام (وضع السكون/Doze ووضع الخمول للتطبيقات) التنبيهات غير الدقيقة في بعض الأجهزة. لتحسين الدقة في تنبيهات الصلاة، يمكنك تمكين "السماح بالتنبيهات الدقيقة" من الإعدادات.

# about_learn_more
source: Learn more
ar: اطّلع على التفاصيل

# terms_delivery_header
source: Notification delivery & timing
ar: تسليم الإشعارات وتوقيتها

# terms_delivery_body
source: Android may defer non‑exact alarms while the device is idle to save battery. Where supported, the app requests the “Allow exact alarms” special access to deliver time‑critical alerts, but OEM and power‑saving settings may still affect delivery on some devices.
ar: قد يؤجّل أندرويد التنبيهات غير الدقيقة عندما يكون الجهاز في وضع الخمول لتوفير الطاقة. حيثما أمكن، يطلب التطبيق وصول "السماح بالتنبيهات الدقيقة" لتسليم التنبيهات الحسّاسة للوقت، إلا أن إعدادات المصنع أو توفير الطاقة قد تؤثر على التسليم في بعض الأجهزة.

# about_feature_offline
source: Works offline for daily ṣalāh times
ar: يعمل دون اتصال لأوقات الصلاة اليومية

# about_feature_lightweight
source: Lightweight app; minimal permissions
ar: تطبيق خفيف؛ أذونات محدودة

# about_feature_privacy
source: No account required; privacy‑minded defaults
ar: لا حاجة لحساب؛ إعدادات خصوصية افتراضية

# about_feature_exact
source: Supports “Allow exact alarms” for punctual alerts (Android 12+)
ar: يدعم "السماح بالتنبيهات الدقيقة" لتنبيهات دقيقة (أندرويد 12+)

# contact_title
source: Contact IALFM
ar: تواصل مع IALFM

source: Contact Support
ar: دعم التواصل

# contact_feedback_title
source: Feedback / Features
ar: ملاحظات / ميزات

# contact_board_title
source: Board / Governance
ar: مجلس الإدارة / الحوكمة

# about_last_updated_title
source: Last Updated
ar: آخر تحديث

# about_last_updated_local_prefix
source: Updated locally:
ar: مُحدَّث محليًا:

# about_last_updated_unknown
source: No cloud update yet
ar: لا يوجد تحديث سحابي بعد

# about_ct_suffix
source: CT
ar: بتوقيت الوسط (CT)

# about_last_updated_hint
source: Tip: long‑press the date to check for an update
ar: تلميح: اضغط مطوّلًا على التاريخ للتحقق من وجود تحديث

# about_refresh_updated_toast
source: File downloaded successfully
ar: تم تنزيل الملف بنجاح

# about_refresh_none_toast
source: No update required
ar: لا حاجة للتحديث

# about_refresh_failed_toast
source: Update failed: {error}
ar: فشل التحديث: {error}
